**Specifications - Database**

My stakeholder want me to take the data I have been cleaning and collecting previously in the project, and create a MySQL database for them.

In [1]:
#import libraries
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
connection_str = "mysql+pymysql://root:****@localhost/movies"

In [2]:
#create engine
engine = create_engine(connection_str)

In [3]:
#check if database exists
if database_exists(connection_str) == False: create_database(connection_str)
else: print('The database already exists.')

The database already exists.

**Required Transformation steps:**

Normalize Genre:

* Convert the single string of genres from title basics into 2 new tables.

1. title_genres: with the columns:
    * tconst
    * genre_id

2. genres:

    * genre_id
    * genre_name

In [4]:
#load data 
basics = pd.read_csv("Data/basics.csv.gz", low_memory = False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller"

In [5]:
#creat a new column with a string transformed to a list
basics['genres_split'] = basics['genres'].str.split(',')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020,NaN,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"

In [6]:
#exploding the column of lists
exploded_geners = basics.explode('genres_split')
exploded_geners[['tconst','genres','genres_split']].head(5)

      tconst                  genres genres_split
0  tt0035423  Comedy,Fantasy,Romance       Comedy
0  tt0035423  Comedy,Fantasy,Romance      Fantasy
0  tt0035423  Comedy,Fantasy,Romance      Romance
1  tt0062336                   Drama        Drama
2  tt0069049                   Drama        Drama

In [7]:
#saving the unique values from the exploded column and sorting
unique_geners = sorted(exploded_geners['genres_split'].dropna().unique())
unique_geners

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [8]:
#creat new dataframe
title_genres = exploded_geners[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [9]:
#make the genre map dictionary
genre_ints = range(len(unique_geners))
genres_map = dict(zip(unique_geners, genre_ints))
genres_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [10]:
#make new culumn genre_id
title_genres['genre_id'] = title_genres['genres_split'].map(genres_map)

#drop column 'genres_split'
title_genres = title_genres.drop(columns='genres_split')
title_genres.head()

      tconst  genre_id
0  tt0035423         5
0  tt0035423         9
0  tt0035423        18
1  tt0062336         7
2  tt0069049         7

In [11]:
#create new dataframe for genres
genre_lookup = pd.DataFrame({'genre_name': genres_map.keys(), 
                            'genre_id': genres_map.values()})
genre_lookup.head()

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**Discard unnecessary information:**

For the title basics table, drop the following columns:
* "original_title" (we will use the primary title column instead)
* "isAdult" ("Adult" will show up in the genres so this is redundant information).
* "titleType" (every row will be a movie).
* "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [12]:
#drop unnecessary columns
basics = basics.drop(columns = ['originalTitle','isAdult', 'titleType', 
                                'genres', 'genres_split'])
basics

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,NaN,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,NaN,70
2,tt0069049,The Other Side of the Wind,2018,NaN,122
3,tt0088751,The Naked Monster,2005,NaN,100
4,tt0093119,Grizzly II: Revenge,2020,NaN,74
...,...,...,...,...,...
80718,tt9914942,Life Without Sara Amat,2019,NaN,74
80719,tt9915872,The Last White Witch,2019,NaN,97
80720,tt9916170,The Rehearsal,2019,NaN,51
80721,tt9916190,Safeguard,2020,NaN,90
80722,tt9916362,Coven,2020,NaN,92

**Export basics Table to MySQL**

In [13]:
#check type of Data
basics.dtypes

tconst             object
primaryTitle       object
startYear           int64
endYear           float64
runtimeMinutes      int64
dtype: object

In [14]:
from sqlalchemy.types import *

#сalculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()

#create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Integer(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [15]:
#create table title_basics
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',
          index=False)

In [16]:
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [17]:
#check sql table
q = """
SELECT *
FROM title_basics
LIMIT 5
"""
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,None,70
2,tt0069049,The Other Side of the Wind,2018,None,122
3,tt0088751,The Naked Monster,2005,None,100
4,tt0093119,Grizzly II: Revenge,2020,None,74

**Export title_rating Table to MySQL**

In [18]:
#load data of ratings
ratings = pd.read_csv('Data/ratings.csv.gz', low_memory = False)

In [19]:
#check type of Data
ratings.dtypes

tconst            object
averageRating    float64
numVotes           int64
dtype: object

In [20]:
#сalculate max string lengths for object columns
key_len = ratings['tconst'].fillna('').map(len).max()

#create a schema dictonary using Sqlalchemy datatype objects
ratings_schema = {
    "tconst": String(key_len+1),
    "averageRating": Float(),
    'numVotes':Integer()}

In [21]:
#create table title_ratings
ratings.to_sql('title_ratings',engine,dtype=ratings_schema,if_exists='replace',
               index=False)

In [22]:
engine.execute('ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`);')

In [23]:
#check sql table
q = """
SELECT *
FROM title_ratings
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1874
1  tt0000002            5.9       248
2  tt0000003            6.5      1647
3  tt0000004            5.8       160
4  tt0000005            6.2      2475

**Export genres Table to MySQL**

In [24]:
#check type of Data
genre_lookup.dtypes

genre_name    object
genre_id       int64
dtype: object

In [25]:
#сalculate max string lengths for object columns
genre_name_len = genre_lookup['genre_name'].fillna('').map(len).max()

#create a schema dictonary using Sqlalchemy datatype objects
genre_lookup_schema = {
    "genre_name": Text(genre_name_len+1),
    'genre_id':Integer()}

In [26]:
#create table genres
genre_lookup.to_sql('genres',engine,dtype=genre_lookup_schema,
                    if_exists='replace',index=False)

In [27]:
engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`genre_id`);')

In [28]:
#check sql table
q = """
SELECT *
FROM genres
LIMIT 5
"""
pd.read_sql(q, engine)

  genre_name  genre_id
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

**Export title_genres Table to MySQL**

In [29]:
#check type of Data
title_genres.dtypes

tconst      object
genre_id     int64
dtype: object

In [30]:
#сalculate max string lengths for object columns
key_len = title_genres['tconst'].fillna('').map(len).max()

#create a schema dictonary using Sqlalchemy datatype objects
title_genre_schema = {
    "tconst": String(key_len+1), 
    'genre_id':Integer()}

In [31]:
#save to sql with dtype and index=False
title_genres.to_sql('title_genres',engine,dtype=title_genre_schema,
                    if_exists='replace',index=False)

In [32]:
#check sql table
q = """
SELECT *
FROM title_genres
LIMIT 5
"""
pd.read_sql(q, engine)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

**Export tmdb_data Table to MySQL**

In [33]:
#load financial data
tmdb_data = pd.read_csv('Data/tmdb_results_combined.csv.gz', low_memory = False, lineterminator='\n')

#leave columns needed for analisys
tmdb_data = tmdb_data[['imdb_id', 'revenue', 'budget', 'certification']]
tmdb_data.head()

     imdb_id     revenue      budget certification
0  tt0113026         0.0  10000000.0           NaN
1  tt0113092         0.0         0.0           NaN
2  tt0116391         0.0         0.0           NaN
3  tt0118694  12854953.0    150000.0            PG
4  tt0118852         0.0         0.0             R

In [34]:
#check for duplicates
tmdb_data.duplicated().sum()

4929

In [35]:
#drop duplicates
tmdb_data.drop_duplicates(inplace=True)

In [36]:
tmdb_data.duplicated().sum()

0

In [37]:
#check type of Data
tmdb_data.dtypes

imdb_id           object
revenue          float64
budget           float64
certification     object
dtype: object

In [38]:
#сalculate max string lengths for object columns
key_len = tmdb_data['imdb_id'].fillna('').map(len).max()
certification_len = tmdb_data['certification'].fillna('').map(len).max()

#create a schema dictonary using Sqlalchemy datatype objects
tmdb_schema = {
    "imdb_id": String(key_len+1),
    "revenue": Float(),
    'budget':Float(),
    'certification': Text(certification_len+1)}

In [39]:
#create table tmdb_data
tmdb_data.to_sql('tmdb_data',engine,dtype=tmdb_schema,if_exists='replace',index=False)

In [40]:
engine.execute('ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`);')

In [41]:
#check sql table
q = """
SELECT *
FROM tmdb_data
LIMIT 5
"""
pd.read_sql(q, engine)

     imdb_id     revenue      budget certification
0          0         NaN         NaN          None
1  tt0035423  76019000.0  48000000.0         PG-13
2  tt0062336         0.0         0.0          None
3  tt0069049         0.0  12000000.0             R
4  tt0088751         0.0    350000.0          None

**Checking DATABASE**

In [42]:
#check the database
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4        tmdb_data